DoS Testmessages/CXF-Enc_allowedInjectionPlaces.xml

<soapenv:Envelope xmlns:cxf="http://cxf.kmzs.ba/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" $$PAYLOADATTR$$>
	<soapenv:Header $$PAYLOADATTR$$>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" $$PAYLOADATTR$$>
			<xenc:EncryptedKey Id="EK-E27F8A7F118EDCD83214739362765991" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
				<xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p"/>
				<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#" $$PAYLOADATTR$$>
					<wsse:SecurityTokenReference $$PAYLOADATTR$$>
						<ds:X509Data $$PAYLOADATTR$$>
							<ds:X509IssuerSerial>
								<ds:X509IssuerName>CN=server</ds:X509IssuerName>
								<ds:X509SerialNumber>1993907142</ds:X509SerialNumber>
							</ds:X509IssuerSerial>$$PAYLOADELEMENT$$</ds:X509Data></wsse:SecurityTokenReference>
				</ds:KeyInfo>
				<xenc:CipherData>
					<xenc:CipherValue>St8QOOmseSQiJXszAOw2gCYAJumbFCWRzLmKNq2ievR/ebpSON7kPKOlxFvxVMIAFnyC7DKCnI0f8F4BVTd2Eiz0GFlmVR8v4Y4jSGEj+AxKjP+Ele1IjI00fQpgzEcjKRVUfoDAGWi04W6qqehvtIu4vMsBG10zeVLZGkQRzaHy7hhgKrfqOZABIQRtLwB0Q04oHBpnoqltp+mquZfYWYz0G5iJod8dmpZHCCFU69dPvd1+chkEc820If21xpB2KdQtiOq+fMg0ziDmhxEgocCHLIs7wKTDMj+E4Z3NYQGV3h5JJc+9jQKLlAAkB8Wcm9oiDcXd7ohLM/vQZfsfBg==</xenc:CipherValue>
				</xenc:CipherData>
				<xenc:ReferenceList>
					<xenc:DataReference URI="#ED-E27F8A7F118EDCD83214739362767502"/>
				</xenc:ReferenceList>
			</xenc:EncryptedKey>$$PAYLOADELEMENT$$</wsse:Security>$$PAYLOADELEMENT$$</soapenv:Header>
	<soapenv:Body $$PAYLOADATTR$$>
		<xenc:EncryptedData Id="ED-E27F8A7F118EDCD83214739362767502" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
			<xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/>
			<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#" $$PAYLOADATTR$$>
				<wsse:SecurityTokenReference wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey" $$PAYLOADATTR$$ xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd">
					<wsse:Reference URI="#EK-E27F8A7F118EDCD83214739362765991"/>$$PAYLOADELEMENT$$</wsse:SecurityTokenReference>
			</ds:KeyInfo>
			<xenc:CipherData>
				<xenc:CipherValue>2VEqAdIntVxK3+2inLTg0m5tvBpe8Ojxe5JVyKTjnrHEGULn618NHeq2CccPufV5D2+cZpoo54uvDR/xrdlPPrFk1a/e1jIQ1MHi+cn8EIU=</xenc:CipherValue>
			</xenc:CipherData>
		</xenc:EncryptedData>$$PAYLOADELEMENT$$</soapenv:Body>
$$PAYLOADELEMENT$$</soapenv:Envelope>